---
kind: property
id: P:Autodesk.Revit.DB.DGNImportOptions.DGNModelViewName
source: html/ea5697a3-7367-a9c3-005f-ce4baf4155a9.htm
---
# Autodesk.Revit.DB.DGNImportOptions.DGNModelViewName Property

The model view name to be imported.
 Need user give a model view name to specify which model view need to be imported into Revit

## Syntax (C#)
```csharp
public string DGNModelViewName { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null